---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PrincipalAxesAngle
source: html/99167cdd-54e4-9e07-b964-bb65ae5d4691.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PrincipalAxesAngle Property

Rotation angle between the principal axes and cross section reference planes.

## Syntax (C#)
```csharp
public double PrincipalAxesAngle { get; set; }
```